app/Models/ServiceModel.php

    public function getDataByIdUser($id_user)
    {
        // Tambahkan klausa WHERE pada query untuk memfilter berdasarkan id_user
        return $this->where('id_user', $id_user)->findAll();
---
SELECT *
FROM `tbl_service`
WHERE `id_user` = '7'