app/Models/ShampoModel.php

SELECT *
FROM `tbl_shampo`
WHERE `id_user` = '7'
---
    public function getDataByIdUser($id_user)
    {
        // Tambahkan klausa WHERE pada query untuk memfilter berdasarkan id_user
        return $this->where('id_user', $id_user)->findAll();